Bondzio/dots-on-a-map/gateway/source/Micrium/Examples/Renesas/YWIRELESS-RX65N/BSP/include/iorx651.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC			(*(volatile struct st_bsc     __sfr __evenaccess *)0x81300)
#define	CAC			(*(volatile struct st_cac     __sfr __evenaccess *)0x8B000)
#define	CAN0		(*(volatile struct st_can     __sfr __evenaccess *)0x90200)
#define	CAN1		(*(volatile struct st_can     __sfr __evenaccess *)0x91200)
#define	CMT			(*(volatile struct st_cmt     __sfr __evenaccess *)0x88000)
#define	CMT0		(*(volatile struct st_cmt0    __sfr __evenaccess *)0x88002)
#define	CMT1		(*(volatile struct st_cmt0    __sfr __evenaccess *)0x88008)
#define	CMT2		(*(volatile struct st_cmt0    __sfr __evenaccess *)0x88012)
#define	CMT3		(*(volatile struct st_cmt0    __sfr __evenaccess *)0x88018)
#define	CMTW0		(*(volatile struct st_cmtw    __sfr __evenaccess *)0x94200)
#define	CMTW1		(*(volatile struct st_cmtw    __sfr __evenaccess *)0x94280)
#define	CRC			(*(volatile struct st_crc     __sfr __evenaccess *)0x88280)
#define	DA			(*(volatile struct st_da      __sfr __evenaccess *)0x88040)
#define	DMAC		(*(volatile struct st_dmac    __sfr __evenaccess *)0x82200)
#define	DMAC0		(*(volatile struct st_dmac0   __sfr __evenaccess *)0x82000)
#define	DMAC1		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x82040)
#define	DMAC2		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x82080)
#define	DMAC3		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x820C0)
#define	DMAC4		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x82100)
#define	DMAC5		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x82140)
#define	DMAC6		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x82180)
#define	DMAC7		(*(volatile struct st_dmac1   __sfr __evenaccess *)0x821C0)
#define	DOC			(*(volatile struct st_doc     __sfr __evenaccess *)0x8B080)
#define	DTC			(*(volatile struct st_dtc     __sfr __evenaccess *)0x82400)
#define	EDMAC0		(*(volatile struct st_edmac   __sfr __evenaccess *)0xC0000)
#define	ELC			(*(volatile struct st_elc     __sfr __evenaccess *)0x8B100)
#define	ETHERC0		(*(volatile struct st_etherc  __sfr __evenaccess *)0xC0100)
#define	EXDMAC		(*(volatile struct st_exdmac  __sfr __evenaccess *)0x82A00)
#define	EXDMAC0		(*(volatile struct st_exdmac0 __sfr __evenaccess *)0x82800)
#define	EXDMAC1		(*(volatile struct st_exdmac1 __sfr __evenaccess *)0x82840)
#define	FLASH		(*(volatile struct st_flash   __sfr __evenaccess *)0x81000)
#define	ICU			(*(volatile struct st_icu     __sfr __evenaccess *)0x87000)
#define	IWDT		(*(volatile struct st_iwdt    __sfr __evenaccess *)0x88030)
#define	MMCIF		(*(volatile struct st_mmcif   __sfr __evenaccess *)0x88500)
#define	MPC			(*(volatile struct st_mpc     __sfr __evenaccess *)0x8C100)
#define	MPU			(*(volatile struct st_mpu     __sfr __evenaccess *)0x86400)
#define	MTU			(*(volatile struct st_mtu     __sfr __evenaccess *)0xC120A)
#define	MTU0		(*(volatile struct st_mtu0    __sfr __evenaccess *)0xC1290)
#define	MTU1		(*(volatile struct st_mtu1    __sfr __evenaccess *)0xC1290)
#define	MTU2		(*(volatile struct st_mtu2    __sfr __evenaccess *)0xC1292)
#define	MTU3		(*(volatile struct st_mtu3    __sfr __evenaccess *)0xC1200)
#define	MTU4		(*(volatile struct st_mtu4    __sfr __evenaccess *)0xC1200)
#define	MTU5		(*(volatile struct st_mtu5    __sfr __evenaccess *)0xC1A94)
#define	MTU6		(*(volatile struct st_mtu6    __sfr __evenaccess *)0xC1A00)
#define	MTU7		(*(volatile struct st_mtu7    __sfr __evenaccess *)0xC1A00)
#define	MTU8		(*(volatile struct st_mtu8    __sfr __evenaccess *)0xC1298)
#define	PDC			(*(volatile struct st_pdc     __sfr __evenaccess *)0xA0500)
#define	POE3		(*(volatile struct st_poe     __sfr __evenaccess *)0x8C4C0)
#define	PORT0		(*(volatile struct st_port0   __sfr __evenaccess *)0x8C000)
#define	PORT1		(*(volatile struct st_port1   __sfr __evenaccess *)0x8C001)
#define	PORT2		(*(volatile struct st_port2   __sfr __evenaccess *)0x8C002)
#define	PORT3		(*(volatile struct st_port3   __sfr __evenaccess *)0x8C003)
#define	PORT4		(*(volatile struct st_port4   __sfr __evenaccess *)0x8C004)
#define	PORT5		(*(volatile struct st_port5   __sfr __evenaccess *)0x8C005)
#define	PORT6		(*(volatile struct st_port6   __sfr __evenaccess *)0x8C006)
#define	PORT7		(*(volatile struct st_port7   __sfr __evenaccess *)0x8C007)
#define	PORT8		(*(volatile struct st_port8   __sfr __evenaccess *)0x8C008)
#define	PORT9		(*(volatile struct st_port9   __sfr __evenaccess *)0x8C009)
#define	PORTA		(*(volatile struct st_porta   __sfr __evenaccess *)0x8C00A)
#define	PORTB		(*(volatile struct st_portb   __sfr __evenaccess *)0x8C00B)
#define	PORTC		(*(volatile struct st_portc   __sfr __evenaccess *)0x8C00C)
#define	PORTD		(*(volatile struct st_portd   __sfr __evenaccess *)0x8C00D)
#define	PORTE		(*(volatile struct st_porte   __sfr __evenaccess *)0x8C00E)
#define	PORTF		(*(volatile struct st_portf   __sfr __evenaccess *)0x8C00F)
#define	PORTJ		(*(volatile struct st_portj   __sfr __evenaccess *)0x8C012)
#define	PPG0		(*(volatile struct st_ppg0    __sfr __evenaccess *)0x881E6)
#define	PPG1		(*(volatile struct st_ppg1    __sfr __evenaccess *)0x881F0)
#define	QSPI		(*(volatile struct st_qspi    __sfr __evenaccess *)0x89E00)
#define	RAM			(*(volatile struct st_ram     __sfr __evenaccess *)0x81200)
#define	RIIC0		(*(volatile struct st_riic    __sfr __evenaccess *)0x88300)
#define	RIIC2		(*(volatile struct st_riic    __sfr __evenaccess *)0x88340)
#define	RSPI0		(*(volatile struct st_rspi    __sfr __evenaccess *)0xD0100)
#define	RSPI1		(*(volatile struct st_rspi    __sfr __evenaccess *)0xD0140)
#define	RSPI2		(*(volatile struct st_rspi    __sfr __evenaccess *)0xD0300)
#define	RTC			(*(volatile struct st_rtc     __sfr __evenaccess *)0x8C400)
#define	S12AD		(*(volatile struct st_s12ad   __sfr __evenaccess *)0x89000)
#define	S12AD1		(*(volatile struct st_s12ad1  __sfr __evenaccess *)0x89100)
#define	SCI0		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A000)
#define	SCI1		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A020)
#define	SCI2		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A040)
#define	SCI3		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A060)
#define	SCI4		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A080)
#define	SCI5		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A0A0)
#define	SCI6		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A0C0)
#define	SCI7		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A0E0)
#define	SCI8		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A100)
#define	SCI9		(*(volatile struct st_sci0    __sfr __evenaccess *)0x8A120)
#define	SCI10		(*(volatile struct st_sci10   __sfr __evenaccess *)0xD0040)
#define	SCI11		(*(volatile struct st_sci10   __sfr __evenaccess *)0xD0060)
#define	SCI12		(*(volatile struct st_sci12   __sfr __evenaccess *)0x8B300)
#define	SDHI		(*(volatile struct st_sdhi    __sfr __evenaccess *)0x8AC00)
#define	SDSI		(*(volatile struct st_sdsi    __sfr __evenaccess *)0x95000)
#define	SMCI0		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A000)
#define	SMCI1		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A020)
#define	SMCI2		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A040)
#define	SMCI3		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A060)
#define	SMCI4		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A080)
#define	SMCI5		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A0A0)
#define	SMCI6		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A0C0)
#define	SMCI7		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A0E0)
#define	SMCI8		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A100)
#define	SMCI9		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8A120)
#define	SMCI12		(*(volatile struct st_smci0   __sfr __evenaccess *)0x8B300)
#define	SYSTEM		(*(volatile struct st_system  __sfr __evenaccess *)0x80000)
#define	TEMPS		(*(volatile struct st_temps   __sfr __evenaccess *)0x8C500)
#define	TMR0		(*(volatile struct st_tmr0    __sfr __evenaccess *)0x88200)
#define	TMR1		(*(volatile struct st_tmr1    __sfr __evenaccess *)0x88201)
#define	TMR2		(*(volatile struct st_tmr0    __sfr __evenaccess *)0x88210)
#define	TMR3		(*(volatile struct st_tmr1    __sfr __evenaccess *)0x88211)
#define	TMR01		(*(volatile struct st_tmr01   __sfr __evenaccess *)0x88204)
#define	TMR23		(*(volatile struct st_tmr01   __sfr __evenaccess *)0x88214)
#define	TPU0		(*(volatile struct st_tpu0    __sfr __evenaccess *)0x88108)
#define	TPU1		(*(volatile struct st_tpu1    __sfr __evenaccess *)0x88108)
#define	TPU2		(*(volatile struct st_tpu2    __sfr __evenaccess *)0x8810A)
#define	TPU3		(*(volatile struct st_tpu3    __sfr __evenaccess *)0x8810A)
#define	TPU4		(*(volatile struct st_tpu4    __sfr __evenaccess *)0x8810C)
#define	TPU5		(*(volatile struct st_tpu5    __sfr __evenaccess *)0x8810C)
#define	TPUA		(*(volatile struct st_tpua    __sfr __evenaccess *)0x88100)
#define	USB			(*(volatile struct st_usb     __sfr __evenaccess *)0xA0400)
#define	USB0		(*(volatile struct st_usb0    __sfr __evenaccess *)0xA0000)
#define	WDT			(*(volatile struct st_wdt     __sfr __evenaccess *)0x88020)
#define	FLASHCONST	(*(volatile struct st_flashconst     __sfr __evenaccess *)0xFE7F7D90)
#define	TEMPSCONST	(*(volatile struct st_tempsconst     __sfr __evenaccess *)0xFE7F7D7C)
#ifdef __IAR_SYSTEMS_ICC__
#pragma bitfields=default
#pragma language=restore
#else
#pragma bit_order
#endif

#ifndef __IAR_SYSTEMS_ICC__
#pragma packoption
#endif

#endif
